huarteto/NetBeans/Desktop/Uni segundo/Uni seg/Uni segundo/Segundo Cuatri/ARM/ARM 2/Boards/Atmel/ATSAM3S-EK/RTX_Blinky/GLCD_MEM_SAM3S.c
/*******************************************************************************
* Read from LCD register                                                       *
*   Parameter:    reg:    register to be read                                  *
*   Return:               value read from register                             *
*******************************************************************************/

static unsigned short rd_reg (unsigned char reg) {

  wr_cmd(reg);
  return (rd_dat());
}


/************************ Exported functions **********************************/

/*******************************************************************************
* Initialize the Graphic LCD controller                                        *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/
#define LCD_D0_D7       (0xFF)
#define LCD_RS          (PIO_PC19)
#define LCD_RD          (PIO_PC11)
#define LCD_WR          (PIO_PC8)
#define LCD_NCS1        (PIO_PC15)
#define LCD_BACKLIGHT   (PIO_PC13)

void GLCD_Init (void) { 
  static unsigned short driverCode;
  unsigned int mode, i;

/* Configure the LCD Control pins -------------------------------------------*/
  PMC->PMC_WPMR = 0x504D4300;                  /* Disable write protect */
  PMC->PMC_PCER1 = (1 << ID_PIOC);             /* enable clock for PIOC */

/* Configure the Data Bus pins ----------------------------------------------*/
  PIOC->PIO_PDR    =  (LCD_D0_D7);            /* enable Peripheral function */  
  PIOC->PIO_IDR    =  (LCD_D0_D7);            /* disable interrupt */ 
  PIOC->PIO_ABCDSR[0]  &= ~(LCD_D0_D7);       /* select Peripheral A */ 
  PIOC->PIO_ABCDSR[1]  &= ~(LCD_D0_D7);       /* select Peripheral A */ 

/* Configure the Control pins -----------------------------------------------*/
  PIOC->PIO_PDR    =  (LCD_RS);               /* enable Peripheral function */ 
  PIOC->PIO_IDR    =  (LCD_RS);               /* disable interrupt */ 
  PIOC->PIO_ABCDSR[0] &= ~(LCD_RS);           /* select Peripheral A */ 
  PIOC->PIO_ABCDSR[1] &= ~(LCD_RS);           /* select Peripheral A */ 

  PIOC->PIO_PDR    =  (LCD_RD | LCD_WR);      /* enable Peripheral function */ 
  PIOC->PIO_IDR    =  (LCD_RD | LCD_WR);      /* disable interrupt */ 
  PIOC->PIO_ABCDSR[0] &= ~(LCD_RD | LCD_WR);  /* select Peripheral A */ 
  PIOC->PIO_ABCDSR[1] &= ~(LCD_RD | LCD_WR);  /* select Peripheral A */ 

  PIOC->PIO_PDR    =  (LCD_NCS1);             /* enable Peripheral function */  
  PIOC->PIO_IDR    =  (LCD_NCS1);             /* disable interrupt */ 
  PIOC->PIO_ABCDSR[0] &= ~(LCD_NCS1);         /* select Peripheral A */ 
  PIOC->PIO_ABCDSR[1] &= ~(LCD_NCS1);         /* select Peripheral A */ 

/* Configure the Backlight pins ---------------------------------------------*/
  PIOC->PIO_IDR  =                             /* disable interrupt */
  PIOC->PIO_OER  =                             /* enable output */
  PIOC->PIO_PER  = (LCD_BACKLIGHT);            /* disable Peripheral function */ 
  PIOC->PIO_CODR = (LCD_BACKLIGHT);            /* Backlight off */

/*-- SMC Configuration ------------------------------------------------------*/
/*--------------------------- CS2 -------------------------------------------*/
  PMC->PMC_PCER0 = (1 << ID_SMC);              /* enable clock for SMC   */

  SMC->SMC_CS_NUMBER[1].SMC_SETUP = 0
                                 | ((  2 <<  0) & SMC_SETUP1_NWE_SETUP)
                                 | ((  2 <<  8) & SMC_SETUP1_NCS_WR_SETUP)
                                 | ((  2 << 16) & SMC_SETUP1_NRD_SETUP)
                                 | ((  2 << 24) & SMC_SETUP1_NCS_RD_SETUP)
                                 ;

  SMC->SMC_CS_NUMBER[1].SMC_PULSE = 0
                                 | (( 4 <<  0) & SMC_PULSE1_NWE_PULSE)
                                 | (( 4 <<  8) & SMC_PULSE1_NCS_WR_PULSE)
                                 | ((10 << 16) & SMC_PULSE1_NRD_PULSE)
                                 | ((10 << 24) & SMC_PULSE1_NCS_RD_PULSE)
                                 ;

  SMC->SMC_CS_NUMBER[1].SMC_CYCLE = 0
                                 | ((10 <<  0) & SMC_CYCLE1_NWE_CYCLE)
                                 | ((22 << 16) & SMC_CYCLE1_NRD_CYCLE)
                                 ;

  mode = SMC->SMC_CS_NUMBER[1].SMC_MODE;
  SMC->SMC_CS_NUMBER[1].SMC_MODE = (mode & ~(SMC_MODE1_DBW | SMC_MODE1_READ_MODE | SMC_MODE1_WRITE_MODE))
                                | (SMC_MODE1_READ_MODE)
                                | (SMC_MODE1_WRITE_MODE)
                                | (0)//(SMC_MODE1_DBW)
                                ;

  delay(5);                             /* Delay 50 ms                        */
  driverCode = rd_reg(0x00);
  if (driverCode);                      /* avoid warning */

  /* Start Initial Sequence --------------------------------------------------*/
  wr_reg(0x10, 0x0000);                 /* DSTB = LP = STB = 0                */
  wr_reg(0x00, 0x0001);                 /* Start internal OSC                 */
  wr_reg(0x01, 0x0100);                 /* Set SS and SM bit                  */
  wr_reg(0x02, 0x0700);                 /* Set 1 line inversion               */
  wr_reg(0x03, 0x1038);                 /* Set GRAM write direction and BGR=1 */   // ??
  wr_reg(0x04, 0x0000);                 /* Resize register                    */
  wr_reg(0x08, 0x0202);                 /* 2 lines each, back and front porch */
  wr_reg(0x09, 0x0000);                 /* Set non-disp area refresh cyc ISC  */
  wr_reg(0x0A, 0x0000);                 /* FMARK function                     */
  wr_reg(0x0C, 0x0000);                 /* RGB interface setting              */
  wr_reg(0x0D, 0x0000);                 /* Frame marker Position              */
  wr_reg(0x0F, 0x0000);                 /* RGB interface polarity             */

  /* Power On sequence -------------------------------------------------------*/
  wr_reg(0x10, 0x0000);                 /* Reset Power Control 1              */
  wr_reg(0x11, 0x0000);                 /* Reset Power Control 2              */
  wr_reg(0x12, 0x0000);                 /* Reset Power Control 3              */
  wr_reg(0x13, 0x0000);                 /* Reset Power Control 4              */
  delay(20);                            /* Discharge cap power voltage (200ms)*/
  wr_reg(0x10, 0x1290);                 /* SAP, BT[3:0], AP, DSTB, SLP, STB   */
  wr_reg(0x11, 0x0227);                 /* DC1[2:0], DC0[2:0], VC[2:0]        */
  delay(5);                             /* Delay 50 ms                        */
  wr_reg(0x12, 0x001B);                 /* Internal reference voltage= Vci    */
  delay(5);                             /* Delay 50 ms                        */
  wr_reg(0x13, 0x1100);                 /* Set VDV[4:0] for VCOM amplitude    */
  wr_reg(0x29, 0x0019);                 /* Set VCM[5:0] for VCOMH             */
  wr_reg(0x2B, 0x000D);                 /* Set Frame Rate                     */
  delay(5);                             /* Delay 50 ms                        */
  wr_reg(0x20, 0x0000);                 /* GRAM horizontal Address            */
  wr_reg(0x21, 0x0000);                 /* GRAM Vertical Address              */

